---
kind: other
id: Properties.T:Autodesk.Revit.DB.MeshFromGeometryOperationResult
source: html/c1326734-1bdf-fc79-0958-818003f98b67.htm
---
# MeshFromGeometryOperationResult Properties

Whether the provided data for which this result was
 obtained were internally inconsistent and could not be
 used in its entirety. For example, for extrusion
 operation, profile loops were degenerate
 or improperly oriented with respect to the extrsuion
 direction.